{
  "intents": [
    {
      "tag": "про_python",
      "patterns": [
        "що таке python?", "що таке пайтон",
		"розкажи про мову програмування python", "розкажи про мову програмування пайтон",
		"для чого потрібен python", "для чого потрібен пайтон"
      ],
      "responses": [
        "Python — це високорівнева мова програмування загального призначення, яка зосереджена на читабельності коду. Її створив Гвідо ван Россум у 1991 році.",
        "Python — це універсальна мова, яку використовують майже всюди: штучний інтелект, веб-розробка, автоматизація та скрипти, тестування ПЗ і наукові дослідження."
      ]
    },    
    {
      "tag": "переваги_python",
      "patterns": [
		"які переваги python?", "які переваги пайтон", 
		"розкажи про переваги python", "розкажи про переваги пайтон", 
		"для чого потрібен python", "для чого потрібен пайтон", 
		"чому варто вчити python", "чому варто вчити пайтон"
	  ],
      "responses": [
		"Ключовою перевагою Python є багатофункціональна стандартна бібліотека, що містить готові рішення для більшості типових операцій: від роботи з мережею до обробки даних.",
		"Python — це мультизадачний інструмент, який є стандартом у сферах штучного інтелекту (AI), аналізу даних (Data Science), веб-розробки та автоматизації рутинних процесів.",
		"Синтаксис Python максимально наближений до розмовної англійської, що дозволяє програмістам зосередитися на розв'язанні логічних задач, а не на технічних складнощах написання коду.",
		"Python має величезну екосистему з тисячами сторонніх пакетів (PyPI), які дозволяють інтегрувати готові модулі для будь-яких технічних потреб у кілька рядків коду.",
		"Завдяки логічній структурі та великій спільноті, Python має дуже низький поріг входження, що робить його найкращим вибором для швидкого переходу від навчання до реальних проектів."
		]
    },
	{
      "tag": "бібліотеки_python",
      "patterns": [
        "що таке бібліотека", "бібліотека це", "бібліотека",
		"бібліотека пайтон", "бібліотека python"
      ],
      "responses": [
        "Бібліотека — це збірка готового коду (функцій, класів, змінних), які написані іншими програмістами для розв'язання типових завдань. Використовуються для того, щоб не писати складний код з нуля.",
        "Бібліотека — це збірка готового коду, модулів та функцій, які розробники використовують для вирішення типових завдань без необхідності писати все з нуля. Вона дозволяє значно прискорити процес програмування, надаючи інструменти для роботи з даними, математичних обчислень, розробки вебсайтів чи створення штучного інтелекту.",
        "Головна мета — не витрачати час на створення того, що вже існує. Їх використовують для:\nприскорення розробки;\nнадійності;\nспрощення коду;\nрозширення можливостей."
      ]
    },
	{
      "tag": "типи_бібліотек",
      "patterns": [
        "які є бібліотеки",
		"які є типи бібліотек",
		"типи бібліотек"
      ],
      "responses": [
        "Бібліотеки в Python діляться на стандартні (вбудовані в мову) та сторонні (треба встановлювати окремо).",
		"Бібліотеки в Python поділяються на стандартні, що вбудовані в мову за замовчуванням та сторонні, які потрібно встановлювати окремо через менеджер пакетів pip."		
      ]
    },
	{
      "tag": "стандартні_бібліотеки_python",
      "patterns": [
        "що таке стандартна бібліотека",
		"які є стандартні бібліотеки",
		"стандартна бібліотека це", "стандартна бібліотека"
      ],
      "responses": [
        "Стандартна бібліотека — це набір модулів та інструментів, які встановлюються на комп'ютер разом із самою мовою програмування.",
        "Стандартні бібліотеки покривають більшість базових потреб. В них входять:\nmath: математичні функції;\nos: робота з операційною системою (шлях до файлів, створення папок, …);\ndatatime: робота з датами та часом.;\nrandom: генерація випадкових чисел або вибір випадкового елемента зі списку;\njson: робота з форматом даних JSON (передавання структурованої інформації через мережу);\nsys: взаємодія з самим інтерпретатором (параметри командного рядка)."
      ]
    },
    {
      "tag": "як_використовувати_стандартні_бібліотеки",
      "patterns": [
        "як використовувати стандартні бібліотеки",
        "як додати стандартні бібліотеки"
      ],
      "responses": [
        "Щоб почати роботу з стандартною бібліотекою Python, потрібно імпортувати її в код за допомогою import <назва_бібліотеки>.",
        "Для використання стандартних бібліотек Python необхідно імпортувати потрібний модуль за допомогою ключового слова import на початку вашого скрипту. Після цього ви отримуєте доступ до готових інструментів для роботи з математикою, файлами, мережами та іншими задачами без необхідності встановлення додаткових пакетів."
      ]
    },
    {
      "tag": "сторонні_бібліотеки_python",
      "patterns": [
        "що таке стороння бібліотека",
		"які є сторонні бібліотеки",
		"стороння бібліотека це", "стороння бібліотека"
      ],
      "responses": [
        "Стороння бібліотека — це набір коду, який не входить у стандартний комплект поставки Python, коли ви його завантажуєте з офіційного сайту. Їх створюють незалежні розробники, компанії або спільнота волонтерів.",
        "Сторонні бібліотеки допомагають полегшити роботу з менш розповсюдженими проблемами. В них входять:\nNumPy: для обчислень, роботи з великими масивами та матрицями;\nMatplotlib: побудова графіків та візуалізація даних;\nPyTorch: створення складних нейронних мереж та глибоке навчання;\nFlask: для створення повноцінних вебсайтів;\nNLTK: для обробки та аналізу тексту."
      ]
    },
    {
      "tag": "як_використовувати_сторонні_бібліотеки",
      "patterns": [
        "як використовувати сторонні бібліотеки",
        "як додати сторонні бібліотеки"
      ],
      "responses": [
        "Щоб почати роботу з сторонньою бібліотекою Python, потрібно використовуйте командний рядок із командою pip install назва_бібліотеки та імпортувати її в код за допомогою import <назва_бібліотеки>.",
        "Для використання сторонніх бібліотек їх спочатку потрібно встановити у ваше середовище за допомогою менеджера пакетів (зазвичай це команда pip install назва_бібліотеки). Після встановлення вони використовуються так само, як і стандартні: ви імпортуєте їх через import у коді, щоб отримати доступ до функцій, розроблених спільнотою."
      ]
    },
    {
      "tag": "типи_даних_python",
      "patterns": [
        "які є типи даних у python", "які є типи даних у пайтон",
        "перерахуй типи даних", "надай типи даних", "назови типи даних",
        "базові типи даних", "типи даних"
      ],
      "responses": [
        "У Python типи даних можна класифікувати за їхнім призначенням та властивістю змінності:\nСкалярні типи:числа, логічний тип та рядки;\nКолекції:списки, кортежі, словники та множини.",
        "В Python типи даних поділяються на змінювані (списки, словники, множини) та незмінювані (числа, рядки, кортежі). Основні з них включають int і float для чисел, str для тексту, а також структури на кшталт list та dict для зберігання колекцій об'єктів."
      ]
    },
    {
      "tag": "type_int",
      "patterns": [
        "як працює int", "як працює інт", "як працює integer", 
		"що таке int", "що таке інт", "що таке integer",
		"ціле число"
      ],
      "responses": [
        "Int у Python використовує 'довгу арифметику', що дозволяє оперувати числами будь-якої величини, обмеженими лише обсягом оперативної пам'яті. Кожне ціле число є окремим незмінюваним об'єктом, тому будь-яка математична операція фактично створює в пам'яті новий результат, а не модифікує старий.",
        "Кожне ціле число є окремим незмінюваним об’єктом, тому будь-яка операція (наприклад, додавання) фактично створює новий об’єкт у пам’яті замість модифікації старого."
      ]
    },
    {
      "tag": "type_float",
      "patterns": [
        "як працює float", "як працює флоат",
		"що таке float", "що таке флоат",
		"число з комою", "число з плаваючою комою"
      ],
      "responses": [
        "Дані float зберігаються в пам'яті комп'ютера як двійкові дроби. Через це більшість десяткових дробів (наприклад, 0.3) неможливо представити точно — вони зберігаються лише як наближення.",
        "Python використовує апаратне забезпечення комп'ютера для обчислень, де float зазвичай має 53 біти точного значення."
      ]
    },
    {
      "tag": "type_str",
      "patterns": [
        "як працює str", "як працює стр", "як працює рядок", "як працює string",
		"що таке str", "що таке стр", "що таке рядок", "що таке string",
		"рядок"
      ],
      "responses": [
        "str зберігається як послідовності Unicode-символів. Це означає, що кожен символ (літера, цифра або емодзі) має свій унікальний числовий код, незалежно від мови чи платформи.",
        "Рядок працює як впорядкований масив, де кожен символ має свій індекс, що починається з 0. Ви можете миттєво отримати будь-який символ або його частину."
      ]
    },
    {
      "tag": "списки_python",
      "patterns": [
        "що таке список", "що таке list",
        "як працює список", "як працює list",
		"список це", "список",
		"list це", "list"
      ],
      "responses": [
        "Списки — це динамічні масиви, що зберігаються як впорядкована послідовність посилань на інші об'єкти.",
        "Список у Python працює як динамічний масив, який зберігає посилання на об'єкти в пам'яті за певними індексами (починаючи з 0). Оскільки це впорядкована та змінна структура, ви можете вільно додавати, видаляти або змінювати елементи, а Python автоматично керує виділенням пам'яті для розширення списку."
      ]
    },
    {
      "tag": "створення_списку",
      "patterns": [
        "як створити список", "як створити list"
      ],
      "responses": [
        "Списки створюються за допомогою квадратних дужок [] або функції list().\nmy_list = [] \nfruits = ['apple', 'banana', 10, 3.5]\nchars = list('abc')\nРезультат: ['a', 'b', 'c']",
		"Створити список у Python можна двома основними способами: за допомогою квадратних дужок [] (найпопулярніший варіант) або конструктора list(). Ви можете одразу наповнити його значеннями або створити порожнім, щоб додати елементи пізніше."
      ]
    },
    {
      "tag": "використання_списків",
      "patterns": [
        "для чого використовують список", "для чого використовують list"
      ],
      "responses": [
        "Списки використовуються, коли потрібен гнучкий перелік об'єктів, де важливий порядок.\nПриклади:\nЧерга завдань;\nКолекція товарів у кошику інтернет-магазину;\nЗберігання результатів обчислень, що потрібно відсортувати чи змінити.",
        "Списки використовують для зберігання впорядкованих колекцій даних, якими потрібно маніпулювати в межах однієї змінної. Вони незамінні, коли кількість елементів може змінюватися під час роботи програми або коли важливо зберігати чітку послідовність об'єктів."
      ]
    },
    {
      "tag": "кортежі_python",
      "patterns": [
        "що таке кортеж", "що таке tupel",
        "як працює кортеж", "як працює tupel",
		"кортеж це", "tupel це",
		"кортеж", "tupel"
      ],
      "responses": [
        "Кортежі — це незмінна упорядкована послідовність елементів, що схожа на список, але після створення її не можна змінити.",
        "Кортеж — це структура даних у Python, яка виступає в ролі 'зафіксованого' контейнера для групи об'єктів. Якщо список можна уявити як робочий зошит, де ви постійно щось дописуєте та виправляєте, то кортеж — це надрукована сторінка, де дані залишаються саме в тому вигляді та порядку, в якому вони були внесені спочатку."        
      ]
    },
    {
      "tag": "створення_кортежу",
      "patterns": [
        "як створити кортеж", "як створити tupel"
      ],
      "responses": [
        "Кортежі створюються за допомогою круглих дужок () або функції tuple().\nmy_tuple = ()\ncoordinates = (10, 20)\nsingle_item = (5,)\nnumbers = tuple([1, 2, 3])",
        "Створити кортеж у Python можна за допомогою круглих дужок () або конструктора tuple(). Найважливіша деталь — якщо ви створюєте кортеж лише з одного елемента, після нього обов’язково потрібно поставити кому, інакше Python сприйме це просто як значення в дужках."
      ]
    },
    {
      "tag": "використання_кортежів",
      "patterns": [
        "для чого використовують кортежі", "для чого використовують tupel"
      ],
      "responses": [
        "Кортежі використовуються для даних, які не мають змінюватися протягом роботи програми.\nПриклади:\nКонстанти;\nГеографічні координати;\nЗаписи в базах даних.",
        "Кортежі використовують як 'запечатані' структури даних, коли потрібно гарантувати, що їхній вміст не зміниться протягом виконання програми. Вони ідеально підходять для передачі наборів пов'язаних значень, які мають логічно залишатися цілісними, наприклад, координати точки або налаштування доступу до бази даних."
      ]
    },
    {
      "tag": "словники_python",
      "patterns": [
        "що таке словник", "що таке dict", "що таке dictionary",
        "як працює словник", "як працює dict", "як працює dictionary",
		"словник це", "dict це", "dictionary це",
		"словник", "dict", "dictionary"
      ],
      "responses": [
        "Словник — це вбудований тип даних, який зберігає дані у парах ключ-значення. Це змінна, динамічна та впорядкована колекція, оптимізована для ефективного пошуку даних за допомогою унікальних ключів.",
        "Словник — це впорядкована за порядком додавання структура даних, що працює за принципом 'ключ — значення'. На відміну від списків, де доступ до елементів здійснюється за порядковим номером, у словнику ви звертаєтеся до даних за унікальним іменем (ключем), що робить пошук миттєвим незалежно від розміру словника."
      ]
    },
    {
      "tag": "створення_словника",
      "patterns": [
        "як створити словник", "як створити dict", "як створити dictionary"
      ],
      "responses": [
        "Словники створюються за допомогою фігурних дужок {} з парами ключ: значення або функції dict().\nmy_dict = {}\nuser = {'name': 'Олексій', 'age': 25}\ncar = dict(brand='Ford', model='Mustang').",
        "Створити словник у Python можна за допомогою фігурних дужок {} або конструктора dict(). Основне правило — кожен запис має складатися з пари ключ: значення, де ключ є унікальним ідентифікатором для доступу до даних."
      ]
    },
    {
      "tag": "використання_словника",
      "patterns": [
        "для чого використовують словник", "для чого використовують dict", "для чого використовують dictionary"
      ],
      "responses": [
        "Словники — найкращий інструмент для зберігання структурованих даних, де доступ до значення відбувається за ім'ям.\nПриклади:\nПрофіль користувача;\nТелефонна книга або словник перекладів.\nНалаштування програми.",
        "Словники використовують для швидкого доступу до даних за унікальними ключами, що ідеально підходить для моделювання реальних об'єктів та їхніх характеристик. Це основний інструмент, коли потрібно пов’язати одні дані з іншими і миттєво знаходити потрібну інформацію без перебору всієї колекції."
      ]
    },
    {
      "tag": "множини_python",
      "patterns": [
        "що таке множина", "що таке set",
        "як працює множина", "як працює set"
      ],
      "responses": [
        "Множина — це невпорядкована колекція унікальних, змінних елементів, що використовується для перевірки належності, видалення дублікатів та виконання математичних операцій з множинами.",
        "Множина — це невпорядкована колекція унікальних елементів. Її можна уявити як мішок з об'єктами, де кожен предмет може бути присутнім лише в одному екземплярі, а їхній порядок не має ніякого значення."
      ]
    },
	{
      "tag": "створення_множини",
      "patterns": [
        "як створити множину", "як створити set"
      ],
      "responses": [
        "Множини створюються за допомогою фігурних дужок {} або функції set().\nempty_set = set()\nunique_numbers = {1, 2, 2, 3, 3}\nРезультат: {1, 2, 3}",
		"Створити множину в Python можна за допомогою фігурних дужок {} або конструктора set(). Важливо пам'ятати: щоб створити порожню множину, потрібно використовувати лише set(), оскільки порожні фігурні дужки {} зарезервовані для створення словника."
      ]
    },
	{
      "tag": "використання_множини",
      "patterns": [
        "для чого використовують множини", "для чого використовують set"
      ],
      "responses": [
        "Множини використовуються для роботи з унікальними елементами та математичних операцій.\nПриклади:\nЗберігання списку унікальних IP-адрес, що відвідали сайт;\nПорівняння груп;\nWhitelist(чи є цей елемент у списку дозволених).",
		"Множини використовують для роботи з унікальними даними та виконання математичних операцій над групами об'єктів. Вони є незамінними, коли потрібно миттєво перевірити наявність елемента в колекції або автоматично позбутися повторів у даних."
      ]
    },
	{
      "tag": "оператори_python",
      "patterns": [
        "що таке оператор", "що таке operator",
		"оператор це", "operator це",
		"оператор", "operator"
      ],
      "responses": [
        "Оператор — це спеціальний символ або ключове слово, яке вказує інтерпретатору виконати певну операцію над даними (операндами). Наприклад, у виразі a + b символ + є оператором, а змінні a та b — операндами.",
		"Оператор — це фундаментальна синтаксична одиниця, представлена спеціальним символом або зарезервованим словом, що ініціює виконання конкретної логічної, математичної або обчислювальної операції над об'єктами. В архітектурі мови оператори виступають інструментами трансформації даних, дозволяючи будувати складні вирази та керувати станом програми."
      ]
    },
	{
      "tag": "типи_операторів",
      "patterns": [
        "які є типи операторів",
		"типи операторів"
      ],
      "responses": [
        "Оператори в Python поділяються на арифметичні, логічні, порівняння, присвоєння та умовні оператори. Кожна група виконує специфічну роль: від простих математичних обчислень до перевірки наявності елемента в списку чи порівняння об'єктів у пам'яті.",
		"Оператори в Python класифікують за їхнім призначенням: від математичних обчислень і порівняння значень до логічних операцій та керування змінними. Вони слугують інструментами для маніпуляції даними, дозволяючи перевіряти умови, шукати елементи в колекціях або контролювати ідентичність об'єктів."
      ]
    },
	{
      "tag": "арифметичні_оператори",
      "patterns": [
        "що входить до арифметичних операторів",
		"арифметичні оператори це",
		"арифметичні оператори"
      ],
      "responses": [
        "До арифметичних операторів у Python входять стандартні математичні символи для додавання, віднімання, множення та ділення, а також спеціальні інструменти для роботи з числами. Вони дозволяють виконувати як базові обчислення, так і складні операції, наприклад, знаходження залишку або цілочисельне ділення.",
		"Арифметичні оператори — це набір символів, які використовуються для виконання базових і розширених математичних обчислень над числами. Окрім класичних операцій, таких як додавання чи множення, Python пропонує спеціальні інструменти для піднесення до степеня, отримання остачі та цілочисельного ділення."
      ]
    },
	{
      "tag": "перелік_арифметичних_операторів",
      "patterns": [
        "які оператори вважаються арифметичними",
		"до арифметичних операторів входять",
		"що входить до арифметичних операторів"
      ],
      "responses": [
        "До арифметичних операторів у Python належать символи:\n+ (додавання);\n - (віднімання);\n * (множення);\n / (ділення);\n // (цілочисельне ділення);\n % (остача від ділення); \n ** (піднесення до степеня).\n Ці інструменти дозволяють реалізувати як базові математичні дії, так і специфічні обчислення, необхідні для програмування алгоритмів.",
		"Арифметичні оператори в Python представлені символами:\n + (додавання);\n - (віднімання);\n * (множення);\n / (ділення);\n // (цілочисельне ділення);\n % (остача від ділення);\n ** (піднесення до степеня).\n Вони складають основу для будь-яких математичних маніпуляцій у коді, дозволяючи обробляти числові дані з високою точністю та гнучкістю."
      ]
    },
	{
      "tag": "оператор_додавання",
      "patterns": [
        "що таке оператор додавання",
		"як працює оператор додавання",
		"додавання"
      ],
      "responses": [
        "Оператор додавання в Python позначається символом + (додавання) і використовується для об'єднання значень. Його поведінка залежить від типу даних: для чисел він виконує математичне додавання, а для послідовностей (наприклад, рядків чи списків) — конкатенацію (з'єднання).",
		"Оператор + (додавання) — це універсальний інструмент у Python, який виконує різні дії залежно від того, з чим він працює. Якщо ви подаєте йому числа, він рахує суму; якщо тексти — він 'зшиває' їх в одне ціле."
      ]
    },
	{
      "tag": "оператор_віднімання",
      "patterns": [
        "що таке оператор віднімання",
		"як працює оператор віднімання",
		"віднімання"
      ],
      "responses": [
        "Оператор віднімання в Python позначається символом - (віднімання). Його основна функція — обчислення різниці між двома числами, проте він також використовується як унарний оператор для зміни знака числа на протилежний.",
		"Оператор віднімання у Python — це математичний інструмент, призначений для знаходження різниці між числовими значеннями. Він працює виключно з числами (цілими та дробовими) і не підтримується для колекцій, таких як рядки чи списки."
      ]
    },
	{
      "tag": "оператор_множення",
      "patterns": [
        "що таке оператор множення",
		"як працює оператор множення",
		"множення"
      ],
      "responses": [
        "Оператор множення в Python позначається символом *. Він виконує дві основні ролі: обчислює математичний добуток чисел або дублює послідовності, такі як рядки та списки.",
		"Оператор множення (*) у Python — це багатофункціональний інструмент, який залежно від контексту може бути або арифметичним множником, або засобом для тиражування даних."
      ]
    },
	{
      "tag": "оператор_ділення",
      "patterns": [
        "що таке оператор ділення",
		"як працює оператор ділення",
		"ділення"
      ],
      "responses": [
        "Оператор ділення в Python позначається символом /. Його головна особливість полягає в тому, що він завжди повертає результат у вигляді числа з плаваючою крапкою (float), навіть якщо числа діляться націло.",
		"Оператор / у Python — це арифметичний інструмент, який обчислює частку від ділення одного числа на інше. Його ключовою характеристикою є 'автоматична точність': незалежно від того, які числа ви ділите, результат завжди буде представлений у форматі з десятковою комою."
      ]
    },
	{
      "tag": "оператор_цілочисельного_ділення",
      "patterns": [
        "що таке оператор цілочисельного ділення",
		"як працює оператор цілочисельного ділення",
		"цілочисельне ділення"
      ],
      "responses": [
        "Оператор цілочисельного ділення в Python позначається подвійною косою рискою (//). Він обчислює частку від ділення, але, на відміну від звичайного ділення, завжди відкидає дробову частину повертаючи ціле число.",
		"Оператор // (цілочисельне ділення) — це математичний інструмент, який дозволяє дізнатися, скільки цілих разів одне число 'вміщується' в іншому. На відміну від стандартного ділення, цей оператор не виконує математичне округлення."
      ]
    },
	{
      "tag": "оператор_остачі_від_ділення",
      "patterns": [
        "що таке оператор остачі від ділення",
		"як працює оператор остачі від ділення",
		"остача від ділення"
      ],
      "responses": [
        "Оператор остачі від ділення в Python позначається символом %. Він повертає значення, яке залишається після того, як одне число було поділене на інше націло максимальну кількість разів.",
		"Оператор % — це інструмент, який фокусується не на самому результаті ділення, а на тому, що залишилося після максимального цілого розподілу. Його часто називають оператором 'модуля', і він є незамінним для створення циклічних алгоритмів та перевірки властивостей чисел."
      ]
    },
	{
      "tag": "оператор_піднесення_до_степеня",
      "patterns": [
        "що таке оператор піднесення до степеня",
		"як працює оператор піднесення до степеня",
		"піднесення до степеня"
      ],
      "responses": [
        "Оператор піднесення до степеня в Python позначається **. Він призначений для зведення числа у певну степінь, що є набагато швидшим і зручнішим способом, ніж використання циклів або стандартних математичних функцій.",
		"Оператор ** — це спеціальний інструмент у Python для виконання операції 'число в степені'. Замість того, щоб багато разів множити число на саме себе, ви просто вказуєте основу та показник степеня."
      ]
    },
	{
      "tag": "перелік_логічних_операторів",
      "patterns": [
        "які оператори вважаються логічними",
		"до логічних операторів входять",
		"що входить до логічних операторів"
      ],
      "responses": [
        "Логічні оператори в Python використовуються для перевірки умов та об'єднання кількох виразів у один. Вони працюють із булевими значеннями: True та False.",
		"До списку логічних операторів входять лише три слова: and (логічне 'І'), or (логічне 'АБО') та not (логічне 'НЕ')."
      ]
    },
	{
      "tag": "оператор_і",
      "patterns": [
        "що таке оператор і", "що таке оператор and",
		"як працює оператор і", "як працює оператор and", 
		"оператор і", "оператор and"
      ],
      "responses": [
        "Оператор and (логічне 'І') у Python — це сполучник, який об’єднує дві умови в одну спільну перевірку. Він працює за принципом максимальної суворості: загальний результат буде істинним лише тоді, коли кожна частина виразу є правдивою.",
		"Оператор І — це 'фільтр суворості' у Python. Його головна задача — переконатися, що всі без винятку частини вашої умови є правдивими. Якщо хоча б одна деталь виявиться хибною, оператор бракує весь вираз."
      ]
    },
	{
      "tag": "оператор_або",
      "patterns": [
        "що таке оператор або", "що таке оператор or",
		"як працює оператор або", "як працює оператор or", 
		"оператор або", "оператор or"
      ],
      "responses": [
        "Оператор or (логічне 'АБО') у Python — це сполучник, який дозволяє об’єднувати умови за принципом 'м’якого відбору'. На відміну від суворого and, цьому оператору достатньо, щоб хоча б одне з тверджень виявилося правдивим, щоб увесь вираз став істинним.",
		"Оператор АБО у Python — це сполучник, який повертає True, якщо хоча б один із його операндів є істинним. Він використовується для побудови гнучких умов, де для виконання дії достатньо виконання будь-якої з перелічених вимог."
      ]
    },
	{
      "tag": "оператор_не",
      "patterns": [
        "що таке оператор не", "що таке оператор not",
		"як працює оператор не", "як працює оператор not", 
		"оператор не", "оператор not"
      ],
      "responses": [
        "Оператор not (логічне 'НЕ') у Python — це унарний оператор, який виконує операцію логічного заперечення. Його єдина функція — змінювати логічне значення свого операнда на протилежне: True стає False, а False стає True.",
		"Оператор НЕ — це інвертор логічного стану. Його функція полягає в тому, щоб перетворити істинне твердження на хибне, а хибне — на істинне. Це єдиний логічний оператор, який працює тільки з одним значенням."
      ]
    },
	{
      "tag": "перелік_операторів_порівняння",
      "patterns": [
        "які оператори вважаються порівняльними",
		"до порівняльних операторів входять",
		"що входить до порівняльних операторів"
      ],
      "responses": [
        "Оператори порівняння в Python призначені для зіставлення двох значень. Результатом їхньої роботи завжди є булеве значення: True або False.\nДо порівняльних операторів входять:\n== (Дорівнює);\n!= (Не дорівнює);\n> (Більше) та < (Менше);\n>= (Більше або дорівнює) та <= (Менше або дорівнює);",
		"Оператори порівняння — це інструменти, які дозволяють програмі зіставляти два об'єкти (числа, рядки, списки) та робити висновок про їхнє співвідношення. Результат такої перевірки завжди однозначний: або True, або False."
      ]
    },
	{
      "tag": "оператор_дорівнює",
      "patterns": [
        "що таке оператор дорівнює",
		"як працює оператор дорівнює",
		"оператор дорівнює"
      ],
      "responses": [
        "Оператор == (дорівнює) у Python — це оператор порівняння, який перевіряє, чи є значення двох об’єктів однаковими. Його головна задача — надати відповідь 'Так' (True) або 'Ні' (False) на питання, чи рівні між собою ліва та права частини виразу.",
		"Оператор дорівнює (==) — це інструмент для перевірки еквівалентності значень. Коли ви використовуєте його в коді, ви ставите програмі запитання: 'Чи є вміст цих двох об'єктів однаковим?'. Результатом завжди буде логічна відповідь: True або False."
      ]
    },
	{
      "tag": "оператор_не_дорівнює",
      "patterns": [
        "що таке оператор не дорівнює",
		"як працює оператор не дорівнює",
		"оператор не дорівнює"
      ],
      "responses": [
        "Оператор != (не дорівнює) у Python — це оператор порівняння, який є повною протилежністю оператору рівності. Він перевіряє, чи відрізняються значення двох об’єктів між собою.",
		"Оператор не дорівнює (!=) — це інструмент для перевірки розбіжності значень. Ви використовуєте його, коли хочете переконатися, що один об'єкт не є копією іншого за своїм змістом."
      ]
    },
	{
      "tag": "оператор_більше",
      "patterns": [
        "що таке оператор більше",
		"як працює оператор більше",
		"оператор більше"
      ],
      "responses": [
        "ератор > (більше) у Python — це оператор порівняння, який визначає, чи є значення лівого операнда суворо більшим за значення правого операнда. Результатом його роботи завжди є булеве значення: True або False.",
		"Оператор > (більше) — це інструмент для перевірки переваги одного значення над іншим. Він виконує роль математичного фільтра, який підтверджує, що об'єкт зліва знаходиться далі за шкалою значень, ніж об'єкт справа."
      ]
    },
	{
      "tag": "оператор_менше",
      "patterns": [
        "що таке оператор менше",
		"як працює оператор менше",
		"оператор менше"
      ],
      "responses": [
        "Оператор < (менше) у Python — це оператор порівняння, який перевіряє, чи є значення лівого операнда меншим за значення правого. Як і всі оператори порівняння, він повертає логічний результат: True або False.",
		"Оператор < (менше) — це інструмент для перевірки дефіциту або меншої величини одного значення відносно іншого. Він підтверджує, що об'єкт зліва розташований ближче до початку числової осі (або раніше в алфавітному порядку), ніж об'єкт справа."
      ]
    },
	{
      "tag": "оператор_більше_або_дорівнює",
      "patterns": [
        "що таке оператор більше або дорівнює",
		"як працює оператор більше або дорівнює",
		"оператор більше або дорівнює"
      ],
      "responses": [
        "Оператор >= (більше або дорівнює) у Python — це нестрогий оператор порівняння. На відміну від суворого > (більше), він повертає True у двох випадках: якщо ліве число більше за праве або якщо вони абсолютно однакові.",
		"Оператор більше або дорівнює (>=) — це інструмент для перевірки мінімального порогу. Він підтверджує, що значення зліва або перевищує значення справа, або досягло тієї самої межі. Це 'м’яке' порівняння, яке включає і крайній випадок — рівність."
      ]
    },
	{
      "tag": "оператор_менше_або_дорівнює",
      "patterns": [
        "що таке оператор менше або дорівнює",
		"як працює оператор менше або дорівнює",
		"оператор менше або дорівнює"
      ],
      "responses": [
        "Оператор <= (менше або дорівнює) у Python — це нестрогий оператор порівняння. Він перевіряє, чи є значення лівого операнда меншим за значення правого або рівним йому. Результатом завжди є логічне значення: True або False.",
		"Оператор менше або дорівнює (<=) — це інструмент для перевірки максимально допустимої межі. Він підтверджує, що значення зліва або не дотягує до значення справа, або якраз зрівнялося з ним. Це 'несуворе' порівняння, яке вважає істиною і меншу величину, і точний збіг."
      ]
    },
	{
      "tag": "перелік_операторів_присвоєння",
      "patterns": [
        "що входить до операторів присвоєння",
		"оператори присвоєння це",
		"оператори присвоєння"
      ],
      "responses": [
        "Оператори присвоєння в Python — це символи, які використовуються для запису або оновлення значень у змінні. Окрім стандартного знака =, існують так звані комбіновані оператори, які дозволяють одночасно виконати арифметичну операцію та зберегти результат у ту саму змінну.",
		"Оператори присвоєння — це команди для запису або оновлення даних у пам'яті комп'ютера. Окрім базового =, вони включають комбіновані форми для арифметики (+=, -=, *=, /=, //=, %=, **=)."
      ]
    },
	{
      "tag": "перелік_умовних_операторів",
      "patterns": [
        "що входить до умовних операторів",
		"умовні оператори це",
		"умовні оператори"
      ],
      "responses": [
        "Умовні оператори — це конструкції, які дозволяють програмі приймати рішення та змінювати свій шлях виконання залежно від того, чи є певна умова правдивою чи хибною. Фактично, це 'розгалуження' коду: якщо виконується одна умова — робимо перше, якщо інша — робимо друге.",
		"Умовні оператори — це механізм керування логікою програми, який дозволяє їй обирати потрібну дію залежно від конкретних обставин. Ця система працює через послідовну перевірку: оператор if задає початкову умову, elif пропонує додаткові варіанти, якщо перший не підійшов, а else стає фінальним рішенням для всіх інших випадків."		
      ]
    },
	{
      "tag": "оператор_якщо",
      "patterns": [
        "що робить якщо", "що робить if",
		"що робить оператор якщо", "що робить оператор if",
		"оператор якщо", "оператор if"
      ],
      "responses": [
        "Оператор if (якщо) — це головний 'перемикач' у коді, який змушує програму виконувати певну дію лише тоді, коли виконується задана умова. Якщо умова правдива, код усередині блоку запускається; якщо ні — програма просто ігнорує цей блок і йде далі.",
		"Оператор якщо — це вхідні ворота для логіки вашої програми. Він діє як інтелектуальний фільтр: пропускає код до виконання лише в тому разі, якщо задане вами твердження виявляється правдою."
      ]
    },
	{
      "tag": "оператор_інакше",
      "patterns": [
        "що робить інакше", "що робить else",
		"що робить оператор інакше", "що робить оператор else",
		"оператор інакше", "оператор else"
      ],
      "responses": [
        "Оператор else (інакше) — це запасний план вашої програми. Він визначає блок коду, який має виконатися лише в тому випадку, якщо жодна з попередніх умов не спрацювала.",
		"Оператор інакше — це конструкція мови Python, яка визначає блок коду з альтернативним сценарієм виконання. Він є частиною складеного оператора розгалуження та слугує 'точкою захоплення' для всіх випадків, які не задовольнили попередні логічні фільтри."
      ]
    },
	{
      "tag": "оператор_інакше_якщо",
      "patterns": [
        "що робить інакше якщо", "що робить elif",
		"що робить оператор інакше якщо", "що робить оператор elif",
		"оператор інакше якщо", "оператор elif"
      ],
      "responses": [
        "Оператор elif (інакше якщо) — це конструкція, яка дозволяє перевіряти кілька послідовних умов. Він використовується, коли у вашої програми є більше ніж два варіанти розвитку подій.",
		"Оператор 'інакше якщо' — це логічна проміжна ланка в структурі розгалуження, яка реалізує багатоальтернативний вибір. Він дозволяє розширити бінарну логіку до складної системи ієрархічних перевірок, де кожна наступна умова розглядається лише за умови хибності всіх попередніх."
      ]
    }
  ]
}